Revit 2027 API
Metal.MetalPerforations Property
 The property labeled "Cutouts" from the "Metal" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string MetalPerforations { get; }
Public Shared ReadOnly Property MetalPerforations As String
	Get
public:
static property String^ MetalPerforations {
	String^ get ();
}
static member MetalPerforations : string with get
Property Value
String
Remarks
 This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "MetalPerforationsType".
See Also
Reference
Metal Class
Autodesk.Revit.DB.Visual Namespace